//Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
//14212 -> нет
//12821 -> да
//23432 -> да
Console.WriteLine("Введите пятизначное число:  ");
int x=Convert.ToInt32(Console.ReadLine());
int x1=x/10000;
int x2=x/1000;
int x3=x/10;
int x4=x%10;
if ((x1==x4)&&(x3%10==x2%10)) Console.WriteLine ("Является палиндромом");
else Console.WriteLine ("Не является палиндромом");
