// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
Console.WriteLine ("Введите цифру, обозначающую день недели: 1-понедельник, 2-вторник и т.д. ");
int a=Convert.ToInt32(Console.ReadLine());
if (a > 5)
{
    Console.WriteLine("Выходной день");
}
else
{
    Console.WriteLine("Будний день");
}
